areiter128/DPSK3/dspic/src/init/init_pwm.c
    // PWM GENERATOR x EVENT REGISTER LOW 
    PG2EVTLbits.ADTR1PS     = 0b00000;      // ADC Trigger 1 Postscaler Selection = 1:1
    PG2EVTLbits.ADTR1EN3    = 0b0;          // PG2TRIGC  Compare Event is disabled as trigger source for ADC Trigger 1
    PG2EVTLbits.ADTR1EN2    = 0b0;          // PG2TRIGB  Compare Event is disabled as trigger source for ADC Trigger 1
    PG2EVTLbits.ADTR1EN1    = 0b1;          // PG2TRIGA  Compare Event is enabled as trigger source for ADC Trigger 1 -> Slope start trigger
    PG2EVTLbits.UPDTRG      = 0b00;         // User must set the UPDATE bit (PG2STAT<4>) manually
    PG2EVTLbits.PGTRGSEL    = 0b000;        // PWM Generator Trigger Output is not used, leave it as default: EOC event is the PWM Generator trigger
    
    // PWM GENERATOR x EVENT REGISTER HIGH
    PG2EVTHbits.FLTIEN      = 0b0;          // PCI Fault interrupt is disabled
    PG2EVTHbits.CLIEN       = 0b0;          // PCI Current-Limit interrupt is disabled
    PG2EVTHbits.FFIEN       = 0b0;          // PCI Feed-Forward interrupt is disabled
    PG2EVTHbits.SIEN        = 0b0;          // PCI Sync interrupt is disabled
    PG2EVTHbits.IEVTSEL     = 0b11;         // Time base interrupts are disabled
    PG2EVTHbits.ADTR2EN3    = 0b0;          // PG2TRIGC register compare event is disabled as trigger source for ADC Trigger 2
    PG2EVTHbits.ADTR2EN2    = 0b1;          // PG2TRIGB register compare event is disabled as trigger source for ADC Trigger 2 -> Slope stop trigger
    PG2EVTHbits.ADTR2EN1    = 0b0;          // PG2TRIGA register compare event is disabled as trigger source for ADC Trigger 2
    PG2EVTHbits.ADTR1OFS    = 0b00000;      // ADC Trigger 1 offset = 0
    
    // PGCLPCIH: PWM GENERATOR CL PCI REGISTER HIGH
    PG2CLPCIHbits.BPEN      = 0b0;          // PCI function is not bypassed
    PG2CLPCIHbits.BPSEL     = 0b000;        // PCI control is sourced from PWM Generator 1 PCI logic when BPEN = 1
    PG2CLPCIHbits.ACP       = 0b011;        // PCI Acceptance Mode: Latched
    PG2CLPCIHbits.SWPCI     = 0b0;          // Drives a '0' to PCI logic assigned to by the SWPCIM<1:0> control bits
    PG2CLPCIHbits.SWPCIM    = 0b00;         // SWPCI bit is assigned to PCI acceptance logic
    PG2CLPCIHbits.PCIGT     = 0b0;          // SR latch is Set-dominant in Latched Acceptance modes; ToDo: Why is this not called LATMOD?
    PG2CLPCIHbits.TQPS      = 0b0;          // Termination Qualifier not inverted
    PG2CLPCIHbits.TQSS      = 0b000;        // No termination qualifier used so terminator will work straight away without any qualifier
    
    // PGCLPCIL: PWM GENERATOR CL PCI REGISTER LOW
    PG2CLPCILbits.TSYNCDIS  = 0;            // Termination of latched PCI occurs at PWM EOC
    PG2CLPCILbits.TERM      = 0b001;        // Termination Event: Terminate when Comparator 2 output transitions from active to inactive
    PG2CLPCILbits.AQPS      = 0b1;          // Acceptance Qualifier (LEB) signal is inverted 
    PG2CLPCILbits.AQSS      = 0b010;        // Acceptance Qualifier: LEB 
    PG2CLPCILbits.SWTERM    = 0b0;          // A write of '1' to this location will produce a termination event. This bit location always reads as '0'.
    PG2CLPCILbits.PSYNC     = 0;            // PCI source is not synchronized to PWM EOC
    PG2CLPCILbits.PPS       = 0;            // Non-inverted PCI polarity
//    PG2CLPCILbits.PSS       = 0b11100;      // Selecting Comparator 2 output as PCI input
     PG2CLPCILbits.PSS       = 0b00000;      // PCI is DISABLED
    
    // Reset further PCI control registers
    PG2FPCIH        = 0x0000;          // PWM GENERATOR F PCI REGISTER HIGH
    PG2FPCIL        = 0x0000;          // PWM GENERATOR F PCI REGISTER LOW
    PG2FFPCIH       = 0x0000;          // PWM GENERATOR FF PCI REGISTER HIGH
    PG2FFPCIL       = 0x0000;          // PWM GENERATOR FF PCI REGISTER LOW
    PG2SPCIH        = 0x0000;          // PWM GENERATOR S PCI REGISTER HIGH
    PG2SPCIL        = 0x0000;          // PWM GENERATOR S PCI REGISTER LOW
    
    // PWM GENERATOR x LEADING-EDGE BLANKING REGISTER HIGH 
    PG2LEBHbits.PWMPCI      = 0b000;        // PWM Generator #1 output is made available to PCI logic
    PG2LEBHbits.PHR         = 0b1;          // Rising edge of PWM2H will trigger the LEB duration counter
    PG2LEBHbits.PHF         = 0b0;          // LEB ignores the falling edge of PWM2H
    PG2LEBHbits.PLR         = 0b0;          // LEB ignores the rising edge of PWM2L
    PG2LEBHbits.PLF         = 0b0;          // LEB ignores the falling edge of PWM2L
    
    // PWM GENERATOR x LEADING-EDGE BLANKING REGISTER LOW 
    PG2LEBL                 = 52;           // ToDo: This value may need further adjustment
    
    // PG2PHASE: PWM GENERATOR x PHASE REGISTER
    PG2PHASE    = 0;
    
    // PG2DC: PWM GENERATOR x DUTY CYCLE REGISTER
//    PG2DC       = 800;      // 80%
    PG2DC       = INIT_DUTY_CYCLE;      // 8% - This is the initial value for the soft-start 
    
    // PG2DCA: PWM GENERATOR 1 DUTY CYCLE ADJUSTMENT REGISTER
    PG2DCA      =  0x0000;      
    
    // PG2PER: PWM GENERATOR x PERIOD REGISTER        
    PG2PER      = 1000;     // 500 kHz

    // PG2TRIGA: PWM GENERATOR x TRIGGER A REGISTER
    PG2TRIGA    = 100;  // Defining start of slope; ToDo: Check this value on oscilloscope
    
    // PG2TRIGB: PWM GENERATOR x TRIGGER B REGISTER       
    PG2TRIGB    = 800;  // Defining end of slope; ToDo: Check this value on oscilloscope
    
    // PG2TRIGC: PWM GENERATOR x TRIGGER C REGISTER        
    PG2TRIGC    = 800;  // ToDo: Check this value on oscilloscope
    
    // PG2DTL: PWM GENERATOR 1 DEAD-TIME REGISTER LOW        
    PG2DTL      = TDF;
    
    // PG2DTH: PWM GENERATOR 1 DEAD-TIME REGISTER HIGH
    PG2DTH      = TDR;
            
//  PG2CAP      = 0x0000;   // Read only register
    
    return(1);
}        

volatile uint16_t launch_boost_pwm(void) {
    
    Nop();
    Nop();
    Nop();
    
    PG2CONLbits.ON = 1; // PWM Generator #2 Enable: PWM Generator is enabled
    PG2STATbits.UPDREQ = 1; // Update all PWM registers

    PG2IOCONHbits.PENH = 0; // PWMxH Output Port Enable: Disabled
    PG2IOCONHbits.PENL = 1; // PWMxL Output Port Enable: PWM generator controls the PWMxL output pin
    PG2IOCONLbits.OVRENH = 1;  // User Override Enable for PWMxH Pin: OVRDAT1 provides data for output on the PWMxH pin
    PG2IOCONLbits.OVRENL = 0;  // User Override Enable for PWMxL Pin: User override disabled

    return(1);
}

void __attribute__((__interrupt__, no_auto_psv)) _PWM1Interrupt(void)
{
    if (++softstart_counter == SST_PERIOD) 
    {
        softstart_counter = 0;
        
        if (++SoftStartDC <= FINAL_DUTY_CYCLE) 
        {
            PG1DC++;
            PG2DC++;
            while (PG1STATbits.UPDATE | PG2STATbits.UPDATE);
            PG1STATbits.UPDREQ = 1; // Update all PWM registers
            PG2STATbits.UPDREQ = 1; // Update all PWM registers
        }
        else {
            IEC4bits.PWM1IE         = 0;    // Disabling PWM1 interrupt when PEAK_CURRENT_MAX is reached
            SoftStartFinished       = 1; 
            
            // ToDo: For debug only
            PG3EVTHbits.IEVTSEL     = 0b10;     // ADC TRIGGER 1 event interrupts CPU
            IPC17bits.PWM3IP        = 5;        // Setting PWM1 interrupt priority
            IFS4bits.PWM3IF         = 0;        // Clearing PWM3 interrupt flag 
            IEC4bits.PWM3IE         = 1;        // Enabling PWM3 interrupt
            // ToDo: For debug only
            PG4EVTHbits.IEVTSEL     = 0b10;     // ADC TRIGGER 1 event interrupts CPU
            IPC17bits.PWM4IP        = 5;        // Setting PWM1 interrupt priority
            IFS4bits.PWM4IF         = 0;        // Clearing PWM4 interrupt flag 
            IEC4bits.PWM4IE         = 1;        // Enabling PWM4 interrupt
            
            
