areiter128/DPSK3/dspic/src/init/init_pwm.c
    // PGxTRIGB: PWM GENERATOR x TRIGGER B REGISTER       
    PG3TRIGB    = BOOST_OFFSET;  // This value sets the delay between PG1 and PG2
    
    // PGxTRIGC: PWM GENERATOR x TRIGGER C REGISTER        
    PG3TRIGC    = 0;  
    
    // PGxDTL: PWM GENERATOR x DEAD-TIME REGISTER LOW        
    PG3DTL      = TDF;
    
    // PGxDTH: PWM GENERATOR x DEAD-TIME REGISTER HIGH
    PG3DTH      = TDR;
            
//  PG3CAP      = 0x0000;   // Read only register
   
    return(1);
}

volatile uint16_t launch_buck_trig_pwm(void) {
    
    Nop();
    Nop();
    Nop();
        
    PG3CONLbits.ON = 1; // PWM Generator #2 Enable: PWM Generator is enabled
    while(PG3STATbits.UPDATE);
    PG3STATbits.UPDREQ = 1; // Update all PWM registers

    PG3IOCONHbits.PENH = 0; // PWMxH Output Port Enable: Disabled
    PG3IOCONHbits.PENL = 0; // PWMxL Output Port Enable: Disabled
    PG3IOCONLbits.OVRENH = 0;  // User Override Enable for PWMxH Pin: User override disabled
    PG3IOCONLbits.OVRENL = 0;  // User Override Enable for PWMxL Pin: User override disabled
   
    return(1); 
}

// This PWM is used only to generate synchronized ADC Trigger 1 for the boost converter
volatile uint16_t init_boost_trig_pwm(void) {

    // PWM GENERATOR 4 CONTROL REGISTERS
    PG4CONLbits.ON = 0; // PWM Generator #4 Enable: PWM Generator is not enabled
    PG4CONLbits.TRGCNT = 0b000; // Trigger Count Select: PWM Generator produces one PWM cycle after triggered
    PG4CONLbits.HREN = 0; // High-Resolution mode is not enabled for PWM Generator 4
    PG4CONLbits.CLKSEL = 0b01; // Clock Selection: PWM Generator uses Master clock selected by the MCLKSEL[1:0] (PCLKCON[1:0]) control bits
    PG4CONLbits.MODSEL = 0b000; // PWM Mode Selection: Independent Edge PWM mode
    
    PG4CONHbits.MDCSEL = 0; // Master Duty Cycle Register Selection: PWM Generator uses PGxDC register
    PG4CONHbits.MPERSEL = 1; // Master Period Register Selection: PWM Generator uses MPER register
    PG4CONHbits.MPHSEL = 0; // Master Phase Register Selection: PWM Generator uses PGxPHASE register
    PG4CONHbits.MSTEN = 0; // Master Update Enable: PWM Generator does not broadcast the UPDREQ status bit state or EOC signal
    PG4CONHbits.UPDMOD = 0b000; // PWM Buffer Update Mode Selection: SOC update
    PG4CONHbits.TRGMOD = 0; // PWM Generator Trigger Mode Selection: PWM Generator operates in single trigger mode
    PG4CONHbits.SOCS = 3; // Start-of-Cycle Selection: PG3 triggers PG4

    // PGxIOCONH: PWM GENERATOR x I/O CONTROL REGISTER LOW
    PG4IOCONL = 0x0000;
    
    // PGxIOCONH: PWM GENERATOR x I/O CONTROL REGISTER HIGH
    PG4IOCONH = 0x0000; // GPIO registers TRISx, LATx, Rxx registers control the PWMxH and PWMxL output pins
        
    // PWM GENERATOR x STATUS REGISTER
    PG4STAT = 0x0000;   // Reset to default
    
    // PWM GENERATOR x EVENT REGISTER LOW 
    PG4EVTLbits.ADTR1PS     = 0b00000;      // ADC Trigger 1 Postscaler Selection = 1:1
    PG4EVTLbits.ADTR1EN3    = 0b0;          // PG1TRIGC  Compare Event is disabled as trigger source for ADC Trigger 1
    PG4EVTLbits.ADTR1EN2    = 0b0;          // PG1TRIGB  Compare Event is disabled as trigger source for ADC Trigger 1
    PG4EVTLbits.ADTR1EN1    = 0b1;          // PG1TRIGA  Compare Event is enabled as trigger source for ADC Trigger 1
    PG4EVTLbits.UPDTRG      = 0b00;         // User must set the UPDATE bit (PG1STAT<4>) manually
    PG4EVTLbits.PGTRGSEL    = 0b010;        // PWM Generator Trigger Output is TRIGB -> trigger for PG1
    
    // PWM GENERATOR x EVENT REGISTER HIGH
    PG4EVTHbits.FLTIEN      = 0b0;          // PCI Fault interrupt is disabled
    PG4EVTHbits.CLIEN       = 0b0;          // PCI Current-Limit interrupt is disabled
    PG4EVTHbits.FFIEN       = 0b0;          // PCI Feed-Forward interrupt is disabled
    PG4EVTHbits.SIEN        = 0b0;          // PCI Sync interrupt is disabled
    PG4EVTHbits.IEVTSEL     = 0b00;         // Interrupt Event Selection: Time based interrupts are disabled
    PG4EVTHbits.ADTR2EN3    = 0b0;          // PG1TRIGC register compare event is disabled as trigger source for ADC Trigger 2
    PG4EVTHbits.ADTR2EN2    = 0b0;          // PG1TRIGB register compare event is disabled as trigger source for ADC Trigger 2
    PG4EVTHbits.ADTR2EN1    = 0b0;          // PG1TRIGA register compare event is disabled as trigger source for ADC Trigger 2
    PG4EVTHbits.ADTR1OFS    = 0b00000;      // ADC Trigger 1 offset = no offset 
    
    // Reset PCI control registers
    PG4CLPCIH       = 0x0000;           // PWM GENERATOR CL PCI REGISTER HIGH
    PG4CLPCIL       = 0x0000;           // PWM GENERATOR CL PCI REGISTER LOW
    PG4FPCIH        = 0x0000;          // PWM GENERATOR F PCI REGISTER HIGH
    PG4FPCIL        = 0x0000;          // PWM GENERATOR F PCI REGISTER LOW
    PG4FFPCIH       = 0x0000;          // PWM GENERATOR FF PCI REGISTER HIGH
    PG4FFPCIL       = 0x0000;          // PWM GENERATOR FF PCI REGISTER LOW
    PG4SPCIH        = 0x0000;          // PWM GENERATOR S PCI REGISTER HIGH
    PG4SPCIL        = 0x0000;          // PWM GENERATOR S PCI REGISTER LOW
    
    // Leading edge blanking is not used
    PG4LEBH         = 0x0000;
    PG4LEBL         = 0x0000;
    
        
    // PG1PHASE: PWM GENERATOR 1 PHASE REGISTER
    PG4PHASE    = 0;
    
    // PG1DC: PWM GENERATOR 1 DUTY CYCLE REGISTER
    PG4DC       = 800;      // 80%
    
    // PG1DCA: PWM GENERATOR 1 DUTY CYCLE ADJUSTMENT REGISTER
    PG4DCA      =  0x0000;      
    
    // PG1PER: PWM GENERATOR 1 PERIOD REGISTER        
    PG4PER      = 1000;     // 500 kHz

    // PG1TRIGA: PWM GENERATOR 1 TRIGGER A REGISTER
    PG4TRIGA    = VOUT_ADC_TRIGGER_DELAY;  // ToDo: Check this value on oscilloscope
    
    // PG1TRIGB: PWM GENERATOR 1 TRIGGER B REGISTER       
    PG4TRIGB    = PWM_PERIOD - BOOST_OFFSET;  
    
    // PG1TRIGC: PWM GENERATOR 1 TRIGGER C REGISTER        
    PG4TRIGC    = 0;  
    
    // PG1DTL: PWM GENERATOR 1 DEAD-TIME REGISTER LOW        
    PG4DTL      = TDF;
    
    // PG1DTH: PWM GENERATOR 1 DEAD-TIME REGISTER HIGH
    PG4DTH      = TDR;
            
//  PG4CAP      = 0x0000;   // Read only register
   
    return(1);

}

volatile uint16_t launch_boost_trig_pwm(void) {
  
    Nop();
    Nop();
    Nop();
    

    
    PG4CONLbits.ON = 1;         // PWM Generator #2 Enable: PWM Generator is enabled
    PG4STATbits.UPDREQ = 1;     // Update all PWM registers

    PG4IOCONHbits.PENH = 0;     // PWMxH Output Port Enable: Disabled
    PG4IOCONHbits.PENL = 0;     // PWMxL Output Port Enable: Disabled
    PG4IOCONLbits.OVRENH = 0;   // User Override Enable for PWMxH Pin: User override disabled
    PG4IOCONLbits.OVRENL = 0;   // User Override Enable for PWMxL Pin: User override disabled


    
    return(1); 
}